; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	spectrograph4 - mode
	image3 - mode
	image1 - mode
	thermograph0 - mode
	infrared2 - mode
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument1 image1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 spectrograph4)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 infrared2)
	(supports instrument7 image1)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument8 spectrograph4)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
	(supports instrument9 image1)
	(supports instrument9 thermograph0)
	(supports instrument9 image3)
	(calibration_target instrument9 GroundStation0)
	(supports instrument10 image3)
	(calibration_target instrument10 Star2)
	(supports instrument11 thermograph0)
	(supports instrument11 spectrograph4)
	(calibration_target instrument11 GroundStation1)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation0)
	(supports instrument12 spectrograph4)
	(supports instrument12 infrared2)
	(calibration_target instrument12 GroundStation1)
	(supports instrument13 image3)
	(supports instrument13 thermograph0)
	(supports instrument13 image1)
	(calibration_target instrument13 Star2)
	(supports instrument14 spectrograph4)
	(supports instrument14 thermograph0)
	(calibration_target instrument14 GroundStation4)
	(on_board instrument12 satellite6)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Phenomenon7)
)
(:goal (and
	(pointing satellite2 Phenomenon5)
	(pointing satellite3 Planet8)
	(have_image Phenomenon5 thermograph0)
	(have_image Phenomenon6 thermograph0)
	(have_image Phenomenon7 spectrograph4)
	(have_image Planet8 image1)
	(have_image Planet9 image1)
	(have_image Planet10 infrared2)
	(have_image Star11 image3)
))

)

; plan
1. (switch_on instrument9 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument9)
   goals met: 0 of 9
2. (calibrate satellite5 instrument9 groundstation0)
   added: (calibrated instrument9)
   goals met: 0 of 9
3. (turn_to satellite5 star11 groundstation0)
   deleted: (pointing satellite5 groundstation0)
   added: (pointing satellite5 star11)
   goals met: 0 of 9
4. (take_image satellite5 star11 instrument9 image3)
   added: (have_image star11 image3)
   goals met: 1 of 9
5. (turn_to satellite5 planet9 star11)
   deleted: (pointing satellite5 star11)
   added: (pointing satellite5 planet9)
   goals met: 1 of 9
6. (take_image satellite5 planet9 instrument9 image1)
   added: (have_image planet9 image1)
   goals met: 2 of 9
7. (turn_to satellite5 phenomenon6 planet9)
   deleted: (pointing satellite5 planet9)
   added: (pointing satellite5 phenomenon6)
   goals met: 2 of 9
8. (take_image satellite5 phenomenon6 instrument9 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 3 of 9
9. (turn_to satellite5 phenomenon5 phenomenon6)
   deleted: (pointing satellite5 phenomenon6)
   added: (pointing satellite5 phenomenon5)
   goals met: 3 of 9
10. (turn_to satellite3 groundstation1 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 groundstation1)
   goals met: 3 of 9
11. (take_image satellite5 phenomenon5 instrument9 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   goals met: 4 of 9
12. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 4 of 9
13. (calibrate satellite3 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 4 of 9
14. (turn_to satellite2 phenomenon5 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon5)
   goals met: 5 of 9
15. (turn_to satellite3 phenomenon7 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon7)
   goals met: 5 of 9
16. (take_image satellite3 phenomenon7 instrument7 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 6 of 9
17. (turn_to satellite3 planet10 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 planet10)
   goals met: 6 of 9
18. (take_image satellite3 planet10 instrument7 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 7 of 9
19. (turn_to satellite3 planet8 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 planet8)
   goals met: 8 of 9
20. (take_image satellite3 planet8 instrument7 image1)
   added: (have_image planet8 image1)
   goals met: 9 of 9
